

const Home = () => {

  console.log("hello kash");

  return (
  
    <div className="container">
      <h1>Kashsan&apos;s Blog</h1>
      <p>
        Webエンジニアになるには時間が相当がかかります。
        それは「勉強することが多いから」とだと言われています。
        しかしそれは果たして真実でしょうか？ <br/><br/>

        わたしが真剣にプログラミングに取り組み始めたのは2025年の2月ごろからです。
        そして初めてReactアプリ(バックエンドはBaaS)をデプロイできたのは同年3月中頃です。<br/>

        それからLaravelを真剣に勉強しはじめて、同年6月にはVPSにLinuxサーバーを構築し、
        Laravel inertia Vue で作ったSNSアプリをデプロイしました。
        現在は Laravel Livewire を使って民泊紹介サイトを製作中です。<br/><br/>

        この半年間、真剣にプログラミングに取り組んできました。
        日々エラーとの戦いを何とか克服し前進してきました。<br/>

        私が今まで個人開発を止めずに続けられたのは、「良いサービスを作りたい」
        という目的意識を持っていたからです。<br/>

        これからもどんどん新しい技術を吸収して皆様に喜んでもらえるような
        サービスを作っていくのが私の夢です。<br/><br/>
        Webエンジニアになることが目的ではなく、気づいたらWebエンジニアになっていたと
        思えるような自分でありたいと思っています。

        
      </p>
    </div>
        
  )
}

export default Home
